package chinese;

import java.io.UnsupportedEncodingException;
import java.util.Random;

public class ChineseName {

	/**
	 * @param args
	 */
	public static void main(String[] args) {
		for(int i=1;i<151;i++)
			System.out.println(i+".\t"+generator());
		
	}
	
	public static String generator(){
		Random random=new Random();
		
		/* 598 百家姓 */
		String[] Surname= {"赵","钱","孙","李","周","吴","郑","王","冯","陈","褚","卫","蒋","沈","韩","杨","朱","秦","尤","许",
				  "何","吕","施","张","孔","曹","严","华","金","魏","陶","姜","戚","谢","邹","喻","柏","水","窦","章","云","苏","潘","葛","奚","范","彭","郎",
				  "鲁","韦","昌","马","苗","凤","花","方","俞","任","袁","柳","酆","鲍","史","唐","费","廉","岑","薛","雷","贺","倪","汤","滕","殷",
				  "张","王","李","张","王","李","张","王","李","赵","张","王","李","张","王","李","张","王","李","赵","张","王","李",
				"张","李","张","王","李","赵","张","王","李","张","王","李","张","王","李","赵","赵","赵","钱","孙","李","周","吴","郑","王",
				"钱","孙","李","周","吴","郑","王","钱","孙","李","周","吴","郑","王","钱","孙","李","周","吴","郑","王","钱","孙","李","周","吴","郑","王",
				"张","李","张","李","张","王","李","赵","张","王","李","张","王","李","张","王","李","张","王","李","赵","张","王","李",
				"张","王","李","张","王","李","张","王","李","赵","张","王","李","张","王","李","张","王","李","张","王","李","赵","张","王","李",
				"周","吴","郑","王","钱","孙","周","吴","郑","王","钱","孙","周","吴","郑","王","钱","孙","周","吴","郑","王","钱","孙","周","吴","郑","王","钱","孙",
				  "罗","毕","郝","邬","安","常","乐","于","时","傅","皮","卞","齐","康","伍","余","元","卜","顾","孟","平","黄","和",
				  "穆","萧","尹","姚","邵","湛","汪","祁","毛","禹","狄","米","贝","计","伏","成","戴","谈","宋","茅","庞","熊","纪","舒",
				  "屈","项","祝","董","梁","杜","阮","蓝","闵","席","季","麻","强","贾","路","娄","危","江","童","颜","郭","梅","盛","林","刁","钟",
					"张","李","张","王","李","赵","张","王","李","张","王","李","张","王","李","赵","赵","赵","钱","孙","李","周","吴","郑","王",
					"钱","孙","李","周","吴","郑","王","钱","孙","李","周","吴","郑","王","钱","孙","李","周","吴","郑","王","钱","孙","李","周","吴","郑","王",
					"张","王","李","张","王","李","张","王","李","赵","张","王","李","张","王","李","张","王","李","张","王","李","赵","张","王","李",
					"张","王","李","张","王","李","张","王","李","赵","张","王","李","张","王","李","张","王","李","张","王","李","赵","张","王","李",
					"周","吴","郑","王","钱","孙","周","吴","郑","王","钱","孙","周","吴","郑","王","钱","孙","周","吴","郑","王","钱","孙","周","吴","郑","王","钱","孙",
				  "徐","邱","骆","高","夏","蔡","田","樊","胡","万","支","柯","昝","管","卢","莫","经","房","裘","缪","干","解","应",
				  "宗","丁","宣","贲","邓","郁","单","杭","洪","包","诸","左","石","崔","吉","钮","龚","程","嵇","邢","滑","裴","陆","荣","翁","荀",
				  "羊","于","惠","甄","曲","家","封","芮","羿","储","靳","汲","邴","糜","松","井","段","富","巫","乌","焦","巴","弓","牧","隗","山",
				  "谷","车","侯","宓","蓬","全","郗","班","仰","秋","仲","伊","宫","宁","仇","栾","暴","甘","钭","厉","戎","祖","武","符","刘","景",
				  "詹","束","龙","叶","幸","印","宿","白","怀","蒲","从","鄂","索","咸","籍","赖","卓",
					"张","王","李","张","王","李","赵","张","王","李","张","王","李","张","王","李","赵","赵","赵","钱","孙","李","周","吴","郑","王",
					"钱","孙","李","周","吴","郑","王","钱","孙","李","周","吴","郑","王","钱","孙","李","周","吴","郑","王","钱","孙","李","周","吴","郑","王",
					"张","王","李","张","王","李","张","王","李","赵","张","王","李","张","王","李","张","王","李","张","王","李","赵","张","王","李",
					"张","王","李","张","王","李","张","王","李","赵","张","王","李","张","王","李","张","王","李","张","王","李","赵","张","王","李",
					"周","吴","郑","王","钱","孙","周","吴","郑","王","钱","孙","周","吴","郑","王","钱","孙","周","吴","郑","王","钱","孙","周","吴","郑","王","钱","孙",
				  "蒙","池","乔","苍","双","闻","莘","党","翟","谭","贡","劳","郦","雍","却",
				  "璩","桑","桂","牛","寿","通","边","扈","燕","冀","浦","尚","农","温","别","庄","晏","柴","瞿","阎","充","慕","连","茹","习",
				  "宦","艾","鱼","容","向","古","易","慎","戈","廖","庾","终","暨","居","衡","步","都","耿","满","弘","匡","国","文","寇","广","禄",
				 "东","欧","师","巩","厍","聂","晁","勾","敖","融","冷","訾","辛",
				  "曾","毋","沙","乜","养","鞠","须","丰","巢","关","蒯","相","查","后","荆","红","游","郏","竺","权","逯","盖","益","桓","公","仉",
					"张","王","李","张","王","李","赵","张","王","李","张","王","李","张","王","李","赵","赵","赵","钱","孙","李","周","吴","郑","王",
					"钱","孙","李","周","吴","郑","王","钱","孙","李","周","吴","郑","王","钱","孙","李","周","吴","郑","王","钱","孙","李","周","吴","郑","王",
					"张","王","李","张","王","李","张","王","李","赵","张","王","李","张","王","李","张","王","李","张","王","李","赵","张","王","李",
					"张","王","李","张","李","张","王","李","赵","张","王","李","张","王","李","张","王","李","张","王","李","赵","张","王","李",
					"周","吴","郑","王","钱","孙","周","吴","郑","王","钱","孙","周","吴","郑","王","钱","孙","周","吴","郑","王","钱","孙","周","吴","郑","王","钱","孙",
				  "督","岳","帅","亢","况","琴","归","海","晋","楚","闫","商","牟","佘","佴","伯","赏","墨",
				 "福","南","冼","楼",
				  "疏","冒","浑","高","皋","原","种","练","弥","仓","眭","蹇","覃","阿","门","恽","来","綦","召","仪","风","介","巨",
				  "木","京","狐","郇","虎","枚","抗","达","杞","苌","折","麦","庆","过","竹","秘","畅","邝","还","宾",
				  "闾","辜","纵","司马","上官","欧阳","夏侯","诸葛",
					"张","王","李","张","王","李","赵","张","王","李","张","王","李","张","王","李","赵","赵","赵","钱","孙","李","周","吴","郑","王",
					"钱","孙","李","周","吴","郑","王","钱","孙","李","周","吴","郑","王","钱","孙","李","周","吴","郑","王","钱","孙","李","周","吴","郑","王",
					"张","王","李","张","王","李","张","李","赵","张","王","李","张","王","李","张","王","李","张","王","李","赵","张","王","李",
					"张","王","李","张","王","李","张","王","李","赵","张","王","李","张","王","李","张","王","李","张","王","李","赵","张","王","李",
					"周","吴","郑","王","钱","孙","周","吴","郑","王","钱","孙","周","吴","郑","王","钱","孙","周","吴","郑","王","钱","孙","周","吴","郑","王","钱","孙",
				  "长孙","呼延","端木","贺兰","独孤","南郭",
				  "张","王","李","张","王","李","张","王","李","赵","张","李","张","王","李","张","王","李","赵","张","王","李",
					"张","王","李","张","王","李","赵","张","王","李","张","王","李","张","王","李","赵","赵","赵","钱","孙","李","周","吴","郑","王",
					"钱","孙","李","周","吴","郑","王","钱","孙","李","周","吴","郑","王","钱","孙","李","周","吴","郑","王","钱","孙","李","周","吴","郑","王"					
		};
		
		int index=random.nextInt(Surname.length-1);		
		String name = Surname[index]; //获得一个随机的姓氏
		
		/* 从常用字中选取一个或两个字作为名 */
		if(random.nextBoolean()){
			name+=getChinese()+getChinese();
		}else {
			name+=getChinese();
		}

		return name+"\t"+getPhoneNumber();
	}
	
	
	public static String getChinese() {
		String str = null;
		int highPos, lowPos;
		Random random = new Random();
		highPos = (176 + Math.abs(random.nextInt(40)));//区码，0xA0打头，从第16区开始，即0xB0=11*16=176,16~55一级汉字，56~87二级汉字
		random=new Random();
		lowPos = 161 + Math.abs(random.nextInt(94));//位码，0xA0打头，范围第1~94列

		byte[] bArr = new byte[2];
		bArr[0] = (new Integer(highPos)).byteValue();
		bArr[1] = (new Integer(lowPos)).byteValue();
		try {
			str = new String(bArr, "GB2312");	//区位码组合成汉字
		} catch (UnsupportedEncodingException e) {
			e.printStackTrace();
		}
			return str;
	}

	public static String getPhoneNumber(){
		String string=null;
		String[] header={"130","131","132","133","134","135","136","137","138","139","147","150","151","152","153",
				"155","156","157","158","159","180","181","182","185","186","187","188","189"};
		Random random=new Random();
		String front=header[random.nextInt(28)];
		int middle= (int) (Math.random()*9000+999);
		
		string =front+"****"+middle;
		return string;
	}
	
}
